![](https://media-exp1.licdn.com/dms/image/C4D0BAQHUQWhqV2rl1g/company-logo_200_200/0/1550502396615?e=2159024400&v=beta&t=_mM0D3cbDu8DL3MUvcb75g65zJ-c4Wd0nrguJGoW_gE)

# SQL - Początkujący

_Mikołaj Leszczuk_

## Konspekt

* Wybieranie rekordów – operacja `SELECT`
* Usuwanie rekordów – operacja `DELETE`
* Dodawanie rekordów – operacja `INSERT`
* Zmiana rekordów – operacja `UPDATE`
* Tworzenie i usuwanie bazy danych
* Tworzenie tabeli w bazie danych

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [1]:
%LOAD CodeBrainers.db rw

## Wybieranie rekordów – operacja `SELECT`

Zapytanie `SELECT` służy do wybierania z bazy danych żądanych rekordów. Jest ono podstawowym i najbardziej rozbudowanym poleceniem języka SQL gdyż często potrzebujemy zaprezentować dane w odpowiedni sposób oraz pobrać je w zależności od innych parametrów. Zapytanie składa się z:

* instrukcji `SELECT` oznaczającej chęć wybrania danych z bazy
* nazw kolumn oddzielonych przecinkami znajdujących się w tabeli (`*` - wszystkie)
* części `FROM` w której podajemy nazwę tabeli

```sqlite
SELECT kolumna,kolumna,.. FROM tabela;
```

```sqlite
SELECT * FROM tabela;
```

Musimy uważać, aby wybierane kolumny istniały w tabeli oraz aby zachować pożądaną kolejność, gdyż kolumny danych będą zwrócone zgodnie z podaną kolejnością.

#### Przykład

**Wybieramy z tabeli Customer wszystkich klientów z ich identyfikatorami, imionami oraz miastami.**

Tabela **Customer**:

In [2]:
SELECT * FROM customer;

+----+-----------+----------+------------+
| id | name      | city     | date       |
+----+-----------+----------+------------+
| 1  | Adam      | Lublin   | 2011-02-05 |
+----+-----------+----------+------------+
| 2  | Monika    | Gdynia   | 2011-02-19 |
+----+-----------+----------+------------+
| 3  | Natalia   | Zakopane | 2011-02-23 |
+----+-----------+----------+------------+
| 4  | Katarzyna | Lublin   | 2011-03-08 |
+----+-----------+----------+------------+
| 5  | Marcin    | Warszawa | 2011-03-21 |
+----+-----------+----------+------------+

Zapytanie i wynik zapytania:

In [3]:
SELECT id,name,city FROM customer;

+----+-----------+----------+
| id | name      | city     |
+----+-----------+----------+
| 1  | Adam      | Lublin   |
+----+-----------+----------+
| 2  | Monika    | Gdynia   |
+----+-----------+----------+
| 3  | Natalia   | Zakopane |
+----+-----------+----------+
| 4  | Katarzyna | Lublin   |
+----+-----------+----------+
| 5  | Marcin    | Warszawa |
+----+-----------+----------+

#### Ćwiczenie

**Wybierz wszystkie identyfikatory i nazwy produktów**

Tabela **Product**:

In [4]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Wpisz zapytanie do bazy!

---

Zapytanie:

In [5]:
SELECT id,name FROM product;

+----+---------+
| id | name    |
+----+---------+
| 5  | Spodnie |
+----+---------+
| 6  | Bluza   |
+----+---------+

Zapytanie `SELECT .. ORDER BY` jest używane do posortowania wybranych danych. Sortowanie odbywa się według wartości podanej kolumny (kolumn). Możemy sortować rosnąco co oznaczamy słowem kluczowym `ASC` (ascend) lub malejąco co oznaczamy słowem `DESC` (descend).

```sqlite
SELECT kolumna1,kolumna2,.. FROM tabela ORDER BY kolumna3 DESC;
```

Sortować można również według kolumn nie wybieranych w danym zapytaniu a tylko znajdujących się w tabeli.

#### Przykład

**Wybieramy z tabeli Product nazwę, cenę i datę dodania produktu posortowane malejąco według daty dodania.**

Tabela **Product**:

In [6]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Zapytanie i wynik zapytania:

In [7]:
SELECT name,price,date FROM product ORDER BY date DESC;

+---------+-------+------------+
| name    | price | date       |
+---------+-------+------------+
| Bluza   | 60.0  | 2011-02-12 |
+---------+-------+------------+
| Spodnie | 100.0 | 2011-02-01 |
+---------+-------+------------+

Zapytanie `SELECT .. WHERE` stosowane jest gdy chcemy wybrać rekordy z tabeli według podanych kryteriów. Wynikiem będą tylko te, które spełniają warunek (warunki) postawiony zaraz po klauzuli `WHERE`.

```sqlite
SELECT kolumna,kolumna,.. FROM tabela WHERE kolumna='wartość';
```

Warunki logiczne mogą składać się z operatorów takich jak:

* znak równości (`=`)
* negacja (`!=`)
* znak mniejszości (`<`) lub (`<=`)
* znak większości (`>`) lub (`>=`)

#### Przykład

**Wybieramy z tabeli Customer imiona klientów którzy mieszkają w Lublinie**

Tabela **Customer**:

In [8]:
SELECT * FROM customer;

+----+-----------+----------+------------+
| id | name      | city     | date       |
+----+-----------+----------+------------+
| 1  | Adam      | Lublin   | 2011-02-05 |
+----+-----------+----------+------------+
| 2  | Monika    | Gdynia   | 2011-02-19 |
+----+-----------+----------+------------+
| 3  | Natalia   | Zakopane | 2011-02-23 |
+----+-----------+----------+------------+
| 4  | Katarzyna | Lublin   | 2011-03-08 |
+----+-----------+----------+------------+
| 5  | Marcin    | Warszawa | 2011-03-21 |
+----+-----------+----------+------------+

Zapytanie i wynik zapytania:

In [9]:
SELECT name FROM customer WHERE city='Lublin';

+-----------+
| name      |
+-----------+
| Adam      |
+-----------+
| Katarzyna |
+-----------+

## Usuwanie rekordów – operacja `DELETE`

Zapytanie `DELETE` służy do usuwania z bazy danych rekordów spełniających podane warunki. Jest to polecenie bardzo proste i niezbędne podczas pracy z bazą. Zapytanie składa się z:

* instrukcji `DELETE` oznaczającej zapytanie usuwające
* części `FROM` w której podajemy nazwę tabeli
* warunku `WHERE` w którym podajemy kryteria które musi spełniać rekord aby został usunięty

```sqlite
DELETE FROM tabela WHERE warunek;
```

Przy usuwaniu rekordów musimy zwrócić szczególną uwagę na klauzulę warunkową. Musi być ona poprawna i uwzględniać tylko te rekordy które faktycznie chcemy usunąć.

#### Przykład

**Usuwamy z tabeli Product wszystkie produkty których są dwie sztuki**

Tabela **Product**:

In [10]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Zapytanie:

In [11]:
SELECT * FROM product WHERE amount='2';

+----+-------+-------+--------+------------+
| id | name  | price | amount | date       |
+----+-------+-------+--------+------------+
| 6  | Bluza | 60.0  | 2      | 2011-02-12 |
+----+-------+-------+--------+------------+

In [12]:
DELETE FROM product WHERE amount='2';

Wynik zapytania:

In [13]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [14]:
%LOAD CodeBrainers.db rw

#### Ćwiczenie

**Usuń wszystkie produkty których cena jest wyższa niż 20**

Tabela **Product**:

In [15]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Wpisz zapytanie do bazy!

---

Zapytanie:

In [16]:
DELETE FROM product WHERE price>20;

Wynik zapytania:

In [17]:
SELECT * FROM product;

+----+------+-------+--------+------+
| id | name | price | amount | date |
+----+------+-------+--------+------+

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [18]:
%LOAD CodeBrainers.db rw

## Dodawanie rekordów – operacja `INSERT`

Zapytanie `INSERT` służy do dodawanie do tabeli nowych rekordów zawierających w odpowiednich kolumnach podane wartości. Zapytanie składa się z:

* instrukcji `INSERT` która oznacza rozpoczęcie operacji wstawiania
* części `INTO` w której podajemy nazwę tabeli
* słowa kluczowego `VALUES`
* listy wartości odpowiadających kolejnym kolumnom

```sqlite
INSERT INTO tabela VALUES (wartość,wartość,..);
```

Możliwa jest również druga forma zapytania `INSERT` w której możemy określić, które kolumny chcemy wypełnić podanymi przez nas wartościami. Wartości przekazane po słowie `VALUES` zostaną wstawione do odpowiadających im kolejno kolumn. Ma ona postać:

```sqlite
INSERT INTO tabela (kolumna,kolumna,..) VALUES (wartość,wartość,..);
```

#### Przykład

**Dodajemy do tabeli Product nowy przedmiot o nazwie Apaszka, cenie 35, liczba sztuk: 2 oraz dacie dodania: 2011-02-20**

Tabela **Product**:

In [19]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Zapytanie:

In [20]:
INSERT INTO product VALUES (9,'Apaszka',35,2,'2011-02-20');

Wynik zapytania:

In [21]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+
| 9  | Apaszka | 35.0  | 2      | 2011-02-20 |
+----+---------+-------+--------+------------+

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [22]:
%LOAD CodeBrainers.db rw

#### Ćwiczenie

**Dodaj do tabeli Product nowy przedmiot o nazwie Kapelusz, cenie 60, liczbie sztuk 4 oraz dacie dodania: 2011-02-28**

Tabela **Product**:

In [23]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

Wpisz zapytanie do bazy!

---

Zapytanie:

In [24]:
INSERT INTO product VALUES (10,'Kapelusz',60,4,'2011-02-28');

Wynik zapytania:

In [25]:
SELECT * FROM product;

+----+----------+-------+--------+------------+
| id | name     | price | amount | date       |
+----+----------+-------+--------+------------+
| 5  | Spodnie  | 100.0 | 5      | 2011-02-01 |
+----+----------+-------+--------+------------+
| 6  | Bluza    | 60.0  | 2      | 2011-02-12 |
+----+----------+-------+--------+------------+
| 10 | Kapelusz | 60.0  | 4      | 2011-02-28 |
+----+----------+-------+--------+------------+

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [26]:
%LOAD CodeBrainers.db rw

## Zmiana rekordów – operacja `UPDATE`

Polecenia `UPDATE` służy do zmiany wartości w istniejących już rekordach w tabeli.

Zapytanie składa się z :

* instrukcji `UPDATE` która oznacza rozpoczęcie operacji zmiany
* nazwy tabeli
* słowa kluczowego `SET`
* listy z przypisaniem kolumna=wartość w której kolumnom przypisywane są ich nowe wartości
* warunku `WHERE` który określa który rekord zostanie zmieniony

```sqlite
UPDATE tabela SET kolumna1=wartość1,kolumna2=wartość2,..
WHERE kolumna=wartość;
```

## Tworzenie i usuwanie bazy danych

**Tworzenie bazy danych** jest to najprostsza czynność przy rozpoczęciu pracy w bazie danych, ale i zarazem podstawowa.

Zapytanie składa się tylko z polecenia:

```sqlite
CREATE DATABASE nazwa bazy;
```

**Usuwanie bazy danych** jest to czynność równie prosta jak tworzenie bazy, jednak niosąca za sobą poważne konsekwencje w postaci utraty wszystkich danych zawartych w jej tabelach i samych tabel. Służy do tego polecenie `DROP DATABASE`

```sqlite
DROP DATABASE nazwa bazy;
```

![](https://niebezpiecznik.pl/wp-content/uploads/2009/10/radar-403x350.jpg)

![](https://niebezpiecznik.pl/wp-content/uploads/2009/10/radar2-450x265.jpg)

![](https://niebezpiecznik.pl/wp-content/uploads/2009/10/radar3-418x350.jpg)

[DROP TABLE users; czyli człowiek-problem na stacjach benzynowych. – Problemy Polskiej Branży IT](https://ppbit.pl/pudelek/drop-table-users-czyli-czlowiek-problem-na-stacjach-benzynowych/)

## Tworzenie tabeli w bazie danych

**Tworzenie tabeli w bazie danych** jest to trochę bardziej skomplikowana czynność niż tworzenie bazy, gdyż tworząc tabelę musimy stworzyć znajdujące się w niej kolumny i zdefiniować ich właściwości jak np. typ, maksymalna długość wartości i inne.

Zapytanie składa się z polecenia:

* klauzuli `CREATE TABLE`
* nazwy nowej tabeli
* listy kolumn wraz z ich szczegółami oddzielonych przecinkiem `nazwa typ(długość)` atrybuty

```sqlite
CREATE TABLE nazwa tabeli (nazwa kolumny typ(długość) NOT NULL);
```

Atrybuty to:

* `NOT NULL` – pole musi mieć nadaną wartość, jeśli pominięte to może mieć wartość `NULL`
* `UNSIGNED` – jeśli pole jest liczbowe to musi mieć wartości nieujemne
* `PRIMARY KEY` – kolumna będzie kluczem podstawowym tabeli. Często występuje razem z polem `SQL AUTO INCREMENT`

**Usuwanie tabeli**

Można całkowicie usunąć tabelę z bazy danych wraz z danymi w niej zawartymi używając polecenia `DROP TABLE` nazwa tabeli

```sqlite
DROP TABLE nazwa_tabeli;
```

![](https://niebezpiecznik.pl/wp-content/uploads/2009/10/xkcd-450x147.gif)

In [27]:
%TABLE_EXISTS Product

The table Product exists.

In [28]:
SELECT * FROM product;

+----+---------+-------+--------+------------+
| id | name    | price | amount | date       |
+----+---------+-------+--------+------------+
| 5  | Spodnie | 100.0 | 5      | 2011-02-01 |
+----+---------+-------+--------+------------+
| 6  | Bluza   | 60.0  | 2      | 2011-02-12 |
+----+---------+-------+--------+------------+

In [29]:
DROP TABLE product;

In [30]:
%TABLE_EXISTS Product

The table Product doesn't exist.

In [31]:
SELECT * FROM product;

Error: no such table: product

Tabelę można również tylko opróżnić tzn. usunąć wszystkie dane ale pozostawić strukturę całej tabeli. Służą do tego polecenia:

* `TRUNCATE TABLE nazwa_tabeli;`	- w: MySQL
* `DELETE FROM nazwa_tabeli;`		- w: SQLite

In [32]:
%TABLE_EXISTS Customer

The table Customer exists.

In [33]:
SELECT * FROM customer;

+----+-----------+----------+------------+
| id | name      | city     | date       |
+----+-----------+----------+------------+
| 1  | Adam      | Lublin   | 2011-02-05 |
+----+-----------+----------+------------+
| 2  | Monika    | Gdynia   | 2011-02-19 |
+----+-----------+----------+------------+
| 3  | Natalia   | Zakopane | 2011-02-23 |
+----+-----------+----------+------------+
| 4  | Katarzyna | Lublin   | 2011-03-08 |
+----+-----------+----------+------------+
| 5  | Marcin    | Warszawa | 2011-03-21 |
+----+-----------+----------+------------+

In [34]:
DELETE FROM customer;

In [35]:
%TABLE_EXISTS Customer

The table Customer exists.

In [36]:
SELECT * FROM customer;

+----+------+------+------+
| id | name | city | date |
+----+------+------+------+

**Przykład tworzenia tabeli Product**

In [37]:
CREATE TABLE "Product" (
	"id"		SMALLINT UNSIGNED IDENTITY(1,1) NOT NULL,
	"name"		VARCHAR(50) NOT NULL,
	"price"		FLOAT NOT NULL,
	"amount"	TINYINT(2) NOT NULL,
	"date"		DATE NOT NULL,
	PRIMARY KEY("id")
);

| Data type |     Range                                                                                    | Storage |
|-----------|----------------------------------------------------------------------------------------------|---------|
| `BIGINT`  | -2<sup>63</sup> (-9,223,372,036,854,775,808) to 2<sup>63</sup>-1 (9,223,372,036,854,775,807) | 8 Bytes |
| `INT`     | -2<sup>31</sup> (-2,147,483,648)             to 2<sup>31</sup>-1 (2,147,483,647)             | 4 Bytes |
| `SMALLINT`| -2<sup>15</sup> (-32,768)                    to 2<sup>15</sup>-1 (32,767)                    | 2 Bytes |
| `TINYINT` |  0                                           to 255                                          | 1 Byte  |

In [38]:
%TABLE_EXISTS Product

The table Product exists.

In [39]:
SELECT * FROM product;

+----+------+-------+--------+------+
| id | name | price | amount | date |
+----+------+-------+--------+------+

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [ ]:
%LOAD CodeBrainers.db rw